---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HiddenBeamsEditingWarning
source: html/35fde391-8fda-73c7-b100-75ad876595d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HiddenBeamsEditingWarning Property

The beam join being modified contains beam that are not visible. Geometry of visible beams may be affected by hidden beams.

## Syntax (C#)
```csharp
public static FailureDefinitionId HiddenBeamsEditingWarning { get; }
```